-- MySQL dump 10.13  Distrib 8.0.31, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: judo
-- ------------------------------------------------------
-- Server version	8.0.31

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `participants`
--

DROP TABLE IF EXISTS `participants`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `participants` (
  `id` int NOT NULL AUTO_INCREMENT,
  `surname` varchar(45) DEFAULT NULL,
  `name` varchar(45) DEFAULT NULL,
  `patronymic` varchar(45) DEFAULT NULL,
  `weight` decimal(3,1) DEFAULT NULL,
  `date_birth` date DEFAULT NULL,
  `health_insurance_number` varchar(10) DEFAULT NULL,
  `login_participant` int DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FK_id_login_participant_idx` (`login_participant`),
  CONSTRAINT `FK_id_login_participant` FOREIGN KEY (`login_participant`) REFERENCES `login` (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=119 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `participants`
--

LOCK TABLES `participants` WRITE;
/*!40000 ALTER TABLE `participants` DISABLE KEYS */;
INSERT INTO `participants` VALUES (2,'Смирнов','Александр','Александрович',62.3,'2010-02-18','5489312675',4),(3,'Иванов','Иван','Иванович',57.8,'2010-06-20','7694235801',5),(4,'Кузнецов','Дмитрий','Дмитриевич',60.2,'2010-05-30','2167398405',6),(5,'Соколов','Максим','Максимович',61.6,'2009-09-08','9528741063',7),(6,'Попов','Артем','Артемович',62.7,'2009-08-23','3045867912',8),(7,'Лебедев','Михаил','Михайлович',56.5,'2009-12-11','6189752304',9),(8,'Козлов','Андрей','Андреевич',61.9,'2010-04-26','4031568729',10),(9,'Новиков','Алексей','Алексеевич',58.4,'2009-07-02','8972430156',11),(10,'Морозов','Сергей','Сергеевич',58.1,'2009-10-01','1356789420',12),(11,'Петров','Николай','Николаевич',56.9,'2010-03-12','9257310468',13),(12,'Волков','Владимир','Владимирович',60.4,'2009-12-15','3624910587',14),(13,'Соловьев','Егор','Егорович',55.3,'2009-07-01','4872039156',15),(14,'Васильев','Илья','Ильич',57.6,'2009-08-07','7081239645',16),(15,'Зайцев','Кирилл','Кириллович',56.1,'2009-07-14','1560493278',17),(16,'Павлов','Даниил','Данилович',57.9,'2009-07-05','2948071635',18),(17,'Семенов','Павел','Павлович',55.9,'2010-02-07','8315279640',19),(18,'Голубев','Антон','Антонович',55.7,'2010-06-01','5704382169',20),(19,'Виноградов','Глеб','Глебович',62.9,'2009-09-18','6903158247',21),(20,'Богданов','Роман','Романович',59.1,'2010-05-14','2174690538',22),(21,'Воробьев','Виктор','Викторович',59.6,'2009-08-27','9760321485',23),(22,'Федоров','Ярослав','Ярославович',61.1,'2009-10-21','4510673928',24),(23,'Михайлов','Василий','Васильевич',59.7,'2009-11-19','8375601249',25),(24,'Беляев','Вадим','Вадимович',57.2,'2010-04-09','1204965387',26),(25,'Тарасов','Игорь','Игоревич',58.8,'2010-06-30','6543128079',27),(26,'Белов','Олег','Олегович',55.5,'2009-12-30','5039186742',28),(27,'Комаров','Степан','Степанович',60.6,'2010-03-26','7826451039',29),(28,'Орлов','Евгений','Евгеньевич',61.8,'2009-11-14','3652914087',30),(29,'Киселев','Арсений','Арсеньевич',56.2,'2009-09-28','8140639275',31),(30,'Макаров','Руслан','Русланович',61.2,'2010-01-22','2409731568',32),(31,'Андреев','Юрий','Юрьевич',59.9,'2010-06-05','3965712804',33),(32,'Ковалев','Денис','Денисович',60.8,'2009-08-15','6894021573',34),(33,'Ильин','Тимофей','Тимофеевич',55.1,'2010-03-01','1578329604',35),(34,'Иванов','Иван','Иванович',24.5,'2011-04-09','9876543210',42),(35,'Смирнов','Алексей','Алексеевич',24.3,'2011-06-17','123456789',43),(36,'Петров','Михаил','Михайлович',22.2,'2012-07-27','2468135790',44),(37,'Козлов','Джейсон','Джейсонович',25.5,'2012-05-25','1357924680',45),(38,'Сидоров','Давид','Давидович',26.5,'2011-12-05','9870123456',46),(39,'Новиков','Марк','Маркович',29.5,'2011-02-04','5432109876',47),(40,'Кузнецов','Андрей','Андреевич',28.0,'2011-11-21','6789012345',48),(41,'Лебедев','Стивен','Стивенович',27.1,'2012-09-16','1234567890',49),(42,'Баранов','Джейкоб','Джейкобович',32.6,'2011-12-12','1234567890',58),(43,'Комаров','Джордан','Джорданович',30.3,'2011-07-03','987654321',59),(44,'Беляев','Джастин','Джастинович',31.5,'2012-02-13','9876543210',60),(45,'Гаврилов','Бенджамин','Бенджаминович',32.8,'2011-10-21','123456789',61),(46,'Лазарев','Андрюша','Андрюшевич',36.6,'2011-09-01','2468135790',62),(47,'Маслов','Итан','Итанович',35.6,'2011-04-23','1357924680',63),(48,'Тихомиров','Джексон','Джексонович',35.9,'2011-06-16','9870123456',64),(49,'Кудряшов','Дилан','Диланович',34.3,'2011-04-11','5432109876',65),(50,'Барсуков','Габриэль','Габриэлевич',38.5,'2009-03-27','6789012345',66),(51,'Савельев','Итан','Итанович',40.7,'2009-09-17','1234567890',67),(52,'Поляков','Лиам','Лиамович',40.7,'2010-09-24','987654321',68),(53,'Сергеев','Оливер','Оливерович',41.7,'2010-12-22','9876543210',69),(54,'Марков','Лукас','Лукасович',44.9,'2009-01-16','123456789',70),(55,'Фадеев','Джейден','Джейденович',42.5,'2009-03-14','2468135790',71),(56,'Голубев','Матео','Матеович',44.9,'2010-11-07','1357924680',72),(57,'Воробьев','Джек','Джекович',44.8,'2009-05-22','9870123456',73),(58,'Королев','Логан','Логанович',49.1,'2009-03-17','5432109876',74),(59,'Беляков','Дэвид','Дэвидович',47.1,'2010-07-25','6789012345',75),(60,'Алексеев','Джозеф','Джозефович',48.2,'2010-11-17','1234567890',76),(61,'Герасимов','Энтони','Энтониевич',49.8,'2009-07-27','987654321',77),(62,'Федотов','Макс','Максимович',50.4,'2010-08-14','9876543210',78),(63,'Соловьев','Айзек','Айзекович',51.1,'2009-07-03','123456789',79),(64,'Власов','Сэмюэль','Сэмюэльевич',50.6,'2009-09-13','2468135790',80),(65,'Карпов','Бенджамин','Бенджаминович',54.7,'2009-11-02','1357924680',81),(66,'Анисимов','Кристофер','Кристоферович',59.3,'2010-09-13','9870123456',82),(67,'Гуляев','Уайатт','Уайаттович',55.9,'2010-03-04','5432109876',83),(68,'Панов','Андрюша','Андрюшевич',56.5,'2009-09-17','6789012345',84),(69,'Миронов','Габриэль','Габриэлевич',57.9,'2009-10-05','1234567890',85),(70,'Панфилов','Джозеф','Джозефович',22.5,'2011-02-26','987654321',86),(71,'Лаврентьев','Лукас','Лукасович',22.8,'2012-09-24','9876543210',87),(72,'Мамонтов','Оливер','Оливерович',22.9,'2011-08-22','123456789',88),(73,'Борисов','Логан','Логанович',22.3,'2012-08-17','2468135790',89),(74,'Гришин','Дэниел','Дэниелович',27.0,'2011-02-05','1357924680',90),(75,'Кузнецов','Мэттью','Мэттьюевич',28.2,'2012-04-01','9870123456',91),(76,'Филиппов','Габриэль','Габриэлевич',27.6,'2011-07-10','5432109876',92),(77,'Малышев','Дилан','Диланович',27.0,'2012-09-17','6789012345',93),(78,'Бирюков','Лиам','Лиамович',31.9,'2012-04-24','1234567890',94),(79,'Пономарев','Джексон','Джексонович',31.4,'2012-11-12','987654321',95),(80,'Громов','Ноа','Ноаович',31.2,'2011-03-05','9876543210',96),(81,'Минаев','Сэмюэль','Сэмюэльевич',33.3,'2012-06-26','123456789',97),(82,'Пахомов','Дэвид','Дэвидович',36.4,'2009-08-12','2468135790',98),(83,'Сигаев','Джозеф','Джозефович',35.5,'2009-09-16','1357924680',99),(84,'Воронин','Габриэль','Габриэлевич',35.5,'2009-10-19','9870123456',100),(85,'Поздняков','Бенджамин','Бенджаминович',35.5,'2010-04-13','5432109876',101),(86,'Капустин','Лукас','Лукасович',40.1,'2010-01-04','6789012345',102),(87,'Мишин','Оливер','Оливерович',39.5,'2010-11-02','1234567890',103),(88,'Шилов','Логан','Логанович',39.2,'2010-02-20','987654321',104),(89,'Дроздов','Уайатт','Уайаттович',39.4,'2009-12-26','9876543210',105),(90,'Селезнев','Андрюша','Андрюшевич',43.0,'2010-10-27','123456789',106),(91,'Захаров','Габриэль','Габриэлевич',45.5,'2009-09-26','2468135790',107),(92,'Савин','Джозеф','Джозефович',44.1,'2010-12-18','1357924680',108),(93,'Чернов','Лукас','Лукасович',44.9,'2009-06-08','9870123456',109),(94,'Виноградов','Оливер','Оливерович',49.5,'2009-08-01','5432109876',110),(95,'Крылов','Логан','Логанович',48.9,'2010-01-26','6789012345',111),(96,'Доронин','Джек','Джекович',49.2,'2010-01-20','1234567890',112),(97,'Мартынов','Джейден','Джейденович',47.0,'2009-10-24','987654321',113),(98,'Литвинов','Бенджамин','Бенджаминович',52.1,'2010-11-01','9876543210',114),(99,'Савельев','Дэниел','Дэниелович',54.6,'2009-10-05','123456789',115),(100,'Казанцев','Джозеф','Джозефович',53.0,'2010-02-15','2468135790',116),(101,'Гордеев','Габриэль','Габриэлевич',50.8,'2009-12-15','1357924680',117),(102,'Лаптев','Дилан','Диланович',56.5,'2010-03-08','9870123456',118),(103,'Комаров','Оливер','Оливерович',55.5,'2010-10-01','5432109876',119),(104,'Климов','Логан','Логанович',57.1,'2010-11-09','6789012345',120),(105,'Самсонов','Вильям','Вильямович',58.1,'2009-03-09','1234567890',121),(106,'Фролов','Джеймс','Джеймсович',60.8,'2010-06-06','987654321',122),(107,'Воробьев','Бенджамин','Бенджаминович',61.2,'2010-07-01','9876543210',123),(108,'Киреев','Сэмюэль','Сэмюэльевич',65.5,'2009-10-05','123456789',124),(109,'Антонов','Габриэль','Габриэлевич',60.5,'2009-09-13','2468135790',125),(118,'Иванов','Иван','Иванович',55.6,'2009-06-11','1234567890',127);
/*!40000 ALTER TABLE `participants` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-06-28 12:25:01
